HatchPointLLC/ArduinoCore-stm32wb/boards.txt
Mothra-WB5MMG.upload.tool=dfu-util
Mothra-WB5MMG.upload.tool.default=dfu-util
Mothra-WB5MMG.upload.protocol=dfu
Mothra-WB5MMG.upload.address=0x08000000
Mothra-WB5MMG.upload.interface=0
Mothra-WB5MMG.upload.vid=0x1209
Mothra-WB5MMG.upload.pid=0x6673
Mothra-WB5MMG.upload.use_1200bps_touch=false
Mothra-WB5MMG.upload.wait_for_upload_port=false
Mothra-WB5MMG.upload.native_usb=true
Mothra-WB5MMG.upload.maximum_size=786432
Mothra-WB5MMG.upload.maximum_data_size=196608

Mothra-WB5MMG.menu.usb.cdc=Serial
Mothra-WB5MMG.menu.usb.cdc.build.usb_type=1
Mothra-WB5MMG.menu.usb.cdc_msc=Serial + Mass Storage
Mothra-WB5MMG.menu.usb.cdc_msc.build.usb_type=2
Mothra-WB5MMG.menu.usb.none=No USB
Mothra-WB5MMG.menu.usb.none.build.usb_type=0

Mothra-WB5MMG.menu.speed.64=64 MHz
Mothra-WB5MMG.menu.speed.64.build.f_cpu=64000000L
Mothra-WB5MMG.menu.speed.32=32 MHz
Mothra-WB5MMG.menu.speed.32.build.f_cpu=32000000L
Mothra-WB5MMG.menu.speed.16=16 MHz (No USB)
Mothra-WB5MMG.menu.speed.16.build.f_cpu=16000000L
Mothra-WB5MMG.menu.speed.2=2 MHz (No USB)
Mothra-WB5MMG.menu.speed.2.build.f_cpu=2000000L

Mothra-WB5MMG.menu.security.none=None
Mothra-WB5MMG.menu.security.sien=Signature + Encryption
Mothra-WB5MMG.menu.security.sien.build.security_flags=-e "{build.keys.keychain}/{build.keys.encrypt_key}" -s "{build.keys.keychain}/{build.keys.sign_key}"
Mothra-WB5MMG.menu.security.sien.build.keys.keychain={runtime.platform.path}/libraries/STM32WB/keys
Mothra-WB5MMG.menu.security.sien.build.keys.sign_key=rsa2048_key.pem
Mothra-WB5MMG.menu.security.sien.build.keys.encrypt_key=aes128_key.bin

# ---------------------------------------
# Tlera Snoopy6
# ---------------------------------------
Snoopy6-WB5MMG.name=Snoopy6-WB5MMG
Snoopy6-WB5MMG.vid.0=0x1209
Snoopy6-WB5MMG.pid.0=0x6674

Snoopy6-WB5MMG.build.f_cpu=64000000L
Snoopy6-WB5MMG.build.board=STM32WB_SNOOPY6
Snoopy6-WB5MMG.build.arch=stm32wb
Snoopy6-WB5MMG.build.core=arduino
Snoopy6-WB5MMG.build.mcu=cortex-m4
Snoopy6-WB5MMG.build.architecture=armv7e-m
Snoopy6-WB5MMG.build.fpu=fpv4-sp-d16
Snoopy6-WB5MMG.build.float-abi=hard
Snoopy6-WB5MMG.build.vid=0x1209
Snoopy6-WB5MMG.build.pid=0x6674
Snoopy6-WB5MMG.build.did=0x0100
Snoopy6-WB5MMG.build.usb_manufacturer="Tlera Corporation"
Snoopy6-WB5MMG.build.usb_product="Snoopy6-WB5MMG"
Snoopy6-WB5MMG.build.extra_flags=-DSTM32WB55xx -fsingle-precision-constant "-D__SYSTEM_CORE_CLOCK__={build.f_cpu}" {build.usb_flags}
Snoopy6-WB5MMG.build.ldscript=STM32WB55xx_FLASH.ld 
Snoopy6-WB5MMG.build.openocdscript=openocd_scripts/snoopy6-wb5mmg.cfg
Snoopy6-WB5MMG.build.variant=Snoopy6-WB5MMG
Snoopy6-WB5MMG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32WBxx/Lib" "-L{runtime.platform.path}/system/CMSIS/DSP/Lib" -lstm32wb55xx -larm_cortexM4lf_math
Snoopy6-WB5MMG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Core/Include" "-I{runtime.platform.path}/system/CMSIS/DSP/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32WBxx/Include" "-I{runtime.platform.path}/system/STM32WBxx/Include" 

Snoopy6-WB5MMG.upload.tool=dfu-util
Snoopy6-WB5MMG.upload.tool.default=dfu-util
Snoopy6-WB5MMG.upload.protocol=dfu
Snoopy6-WB5MMG.upload.address=0x08000000
Snoopy6-WB5MMG.upload.interface=0
Snoopy6-WB5MMG.upload.vid=0x1209
Snoopy6-WB5MMG.upload.pid=0x6674
Snoopy6-WB5MMG.upload.use_1200bps_touch=false
Snoopy6-WB5MMG.upload.wait_for_upload_port=false
Snoopy6-WB5MMG.upload.native_usb=true
Snoopy6-WB5MMG.upload.maximum_size=786432
Snoopy6-WB5MMG.upload.maximum_data_size=196608

Snoopy6-WB5MMG.menu.usb.cdc=Serial
Snoopy6-WB5MMG.menu.usb.cdc.build.usb_type=1
Snoopy6-WB5MMG.menu.usb.cdc_msc=Serial + Mass Storage
Snoopy6-WB5MMG.menu.usb.cdc_msc.build.usb_type=2
Snoopy6-WB5MMG.menu.usb.none=No USB
Snoopy6-WB5MMG.menu.usb.none.build.usb_type=0

Snoopy6-WB5MMG.menu.speed.64=64 MHz
Snoopy6-WB5MMG.menu.speed.64.build.f_cpu=64000000L
Snoopy6-WB5MMG.menu.speed.32=32 MHz
Snoopy6-WB5MMG.menu.speed.32.build.f_cpu=32000000L
Snoopy6-WB5MMG.menu.speed.16=16 MHz (No USB)
Snoopy6-WB5MMG.menu.speed.16.build.f_cpu=16000000L
Snoopy6-WB5MMG.menu.speed.2=2 MHz (No USB)
Snoopy6-WB5MMG.menu.speed.2.build.f_cpu=2000000L

Snoopy6-WB5MMG.menu.security.none=None
Snoopy6-WB5MMG.menu.security.sien=Signature + Encryption
Snoopy6-WB5MMG.menu.security.sien.build.security_flags=-e "{build.keys.keychain}/{build.keys.encrypt_key}" -s "{build.keys.keychain}/{build.keys.sign_key}"
Snoopy6-WB5MMG.menu.security.sien.build.keys.keychain={runtime.platform.path}/libraries/STM32WB/keys
Snoopy6-WB5MMG.menu.security.sien.build.keys.sign_key=rsa2048_key.pem
Snoopy6-WB5MMG.menu.security.sien.build.keys.encrypt_key=aes128_key.bin

# ---------------------------------------
# PG DSOCentral R1.2
# ---------------------------------------
DSOCentralR12-WB5MMG.name=DSOCentralR12-WB5MMG
DSOCentralR12-WB5MMG.vid.0=0x1209
DSOCentralR12-WB5MMG.pid.0=0x6673

DSOCentralR12-WB5MMG.build.f_cpu=64000000L
DSOCentralR12-WB5MMG.build.board=WB5MMG-DSOCentralR12
DSOCentralR12-WB5MMG.build.arch=stm32wb
DSOCentralR12-WB5MMG.build.core=arduino
DSOCentralR12-WB5MMG.build.mcu=cortex-m4
DSOCentralR12-WB5MMG.build.architecture=armv7e-m
DSOCentralR12-WB5MMG.build.fpu=fpv4-sp-d16
DSOCentralR12-WB5MMG.build.float-abi=hard
DSOCentralR12-WB5MMG.build.vid=0x1209
DSOCentralR12-WB5MMG.build.pid=0x6680
DSOCentralR12-WB5MMG.build.did=0x0100
DSOCentralR12-WB5MMG.build.usb_manufacturer="ProctorGamble"
DSOCentralR12-WB5MMG.build.usb_product="DSOCentralR12-WB5MMG"
DSOCentralR12-WB5MMG.build.extra_flags=-DSTM32WB55xx -fsingle-precision-constant "-D__SYSTEM_CORE_CLOCK__={build.f_cpu}" {build.usb_flags}
DSOCentralR12-WB5MMG.build.ldscript=STM32WB55xx_FLASH.ld 
DSOCentralR12-WB5MMG.build.openocdscript=openocd_scripts/DSOCentral.cfg
DSOCentralR12-WB5MMG.build.variant=DSOCentralR12-WB5MMG
DSOCentralR12-WB5MMG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32WBxx/Lib" "-L{runtime.platform.path}/system/CMSIS/DSP/Lib" -lstm32wb55xx -larm_cortexM4lf_math
DSOCentralR12-WB5MMG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Core/Include" "-I{runtime.platform.path}/system/CMSIS/DSP/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32WBxx/Include" "-I{runtime.platform.path}/system/STM32WBxx/Include" 

DSOCentralR12-WB5MMG.upload.tool=dfu-util
DSOCentralR12-WB5MMG.upload.tool.default=dfu-util
DSOCentralR12-WB5MMG.upload.protocol=dfu
DSOCentralR12-WB5MMG.upload.address=0x08000000
DSOCentralR12-WB5MMG.upload.interface=0
DSOCentralR12-WB5MMG.upload.vid=0x1209
DSOCentralR12-WB5MMG.upload.pid=0x6673
DSOCentralR12-WB5MMG.upload.use_1200bps_touch=false
DSOCentralR12-WB5MMG.upload.wait_for_upload_port=false
DSOCentralR12-WB5MMG.upload.native_usb=true
DSOCentralR12-WB5MMG.upload.maximum_size=786432
DSOCentralR12-WB5MMG.upload.maximum_data_size=196608

