HatchPointLLC/ArduinoCore-stm32wb/boards.txt
menu.printf=STM32 printf Version
DSOCentralR12-WB5MMG.menu.printf.default=Default printf
DSOCentralR12-WB5MMG.menu.printf.default.compiler.c.elf.extra_flags=
DSOCentralR12-WB5MMG.menu.printf.full=Full printf
DSOCentralR12-WB5MMG.menu.printf.full.compiler.c.elf.extra_flags=-Wl,-u,vfprintf -u_printf_float
DSOCentralR12-WB5MMG.menu.printf.minimal=Minimal printf
DSOCentralR12-WB5MMG.menu.printf.minimal.compiler.c.elf.extra_flags=-Wl,-u,vfprintf -u_printf_min

DSOCentralR12-WB5MMG.menu.usb.cdc=Serial
DSOCentralR12-WB5MMG.menu.usb.cdc.build.usb_type=1
DSOCentralR12-WB5MMG.menu.usb.cdc_msc=Serial + Mass Storage
DSOCentralR12-WB5MMG.menu.usb.cdc_msc.build.usb_type=2
DSOCentralR12-WB5MMG.menu.usb.none=No USB
DSOCentralR12-WB5MMG.menu.usb.none.build.usb_type=0

DSOCentralR12-WB5MMG.menu.speed.64=64 MHz
DSOCentralR12-WB5MMG.menu.speed.64.build.f_cpu=64000000L
DSOCentralR12-WB5MMG.menu.speed.32=32 MHz
DSOCentralR12-WB5MMG.menu.speed.32.build.f_cpu=32000000L
DSOCentralR12-WB5MMG.menu.speed.16=16 MHz (No USB)
DSOCentralR12-WB5MMG.menu.speed.16.build.f_cpu=16000000L
DSOCentralR12-WB5MMG.menu.speed.2=2 MHz (No USB)
DSOCentralR12-WB5MMG.menu.speed.2.build.f_cpu=2000000L

DSOCentralR12-WB5MMG.menu.security.none=None
DSOCentralR12-WB5MMG.menu.security.sien=Signature + Encryption
DSOCentralR12-WB5MMG.menu.security.sien.build.security_flags=-e "{build.keys.keychain}/{build.keys.encrypt_key}" -s "{build.keys.keychain}/{build.keys.sign_key}"
DSOCentralR12-WB5MMG.menu.security.sien.build.keys.keychain={runtime.platform.path}/libraries/STM32WB/keys
DSOCentralR12-WB5MMG.menu.security.sien.build.keys.sign_key=rsa2048_key.pem
DSOCentralR12-WB5MMG.menu.security.sien.build.keys.encrypt_key=aes128_key.bin

# ---------------------------------------
# PG DSOCentral R2.0
# ---------------------------------------
DSOCentralR20-WB5MMG.name=DSOCentralR20-WB5MMG
DSOCentralR20-WB5MMG.vid.0=0x1209
DSOCentralR20-WB5MMG.pid.0=0x6673

DSOCentralR20-WB5MMG.build.f_cpu=64000000L
DSOCentralR20-WB5MMG.build.board=WB5MMG-DSOCentralR20
DSOCentralR20-WB5MMG.build.arch=stm32wb
DSOCentralR20-WB5MMG.build.core=arduino
DSOCentralR20-WB5MMG.build.mcu=cortex-m4
DSOCentralR20-WB5MMG.build.architecture=armv7e-m
DSOCentralR20-WB5MMG.build.fpu=fpv4-sp-d16
DSOCentralR20-WB5MMG.build.float-abi=hard
DSOCentralR20-WB5MMG.build.vid=0x1209
DSOCentralR20-WB5MMG.build.pid=0x6680
DSOCentralR20-WB5MMG.build.did=0x0100
DSOCentralR20-WB5MMG.build.usb_manufacturer="ProctorGamble"
DSOCentralR20-WB5MMG.build.usb_product="DSOCentralR20-WB5MMG"
DSOCentralR20-WB5MMG.build.extra_flags=-DSTM32WB55xx -fsingle-precision-constant "-D__SYSTEM_CORE_CLOCK__={build.f_cpu}" {build.usb_flags}
DSOCentralR20-WB5MMG.build.ldscript=STM32WB55xx_FLASH.ld 
DSOCentralR20-WB5MMG.build.openocdscript=openocd_scripts/DSOCentral.cfg
DSOCentralR20-WB5MMG.build.variant=DSOCentralR20-WB5MMG
DSOCentralR20-WB5MMG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32WBxx/Lib" "-L{runtime.platform.path}/system/CMSIS/DSP/Lib" -lstm32wb55xx -larm_cortexM4lf_math
DSOCentralR20-WB5MMG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Core/Include" "-I{runtime.platform.path}/system/CMSIS/DSP/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32WBxx/Include" "-I{runtime.platform.path}/system/STM32WBxx/Include" 

DSOCentralR20-WB5MMG.upload.tool=dfu-util
DSOCentralR20-WB5MMG.upload.tool.default=dfu-util
DSOCentralR20-WB5MMG.upload.protocol=dfu
DSOCentralR20-WB5MMG.upload.address=0x08000000
DSOCentralR20-WB5MMG.upload.interface=0
DSOCentralR20-WB5MMG.upload.vid=0x1209
DSOCentralR20-WB5MMG.upload.pid=0x6673
DSOCentralR20-WB5MMG.upload.use_1200bps_touch=false
DSOCentralR20-WB5MMG.upload.wait_for_upload_port=false
DSOCentralR20-WB5MMG.upload.native_usb=true
DSOCentralR20-WB5MMG.upload.maximum_size=786432
DSOCentralR20-WB5MMG.upload.maximum_data_size=196608

menu.printf=STM32 printf Version
#DSOCentralR20-WB5MMG.menu.printf.default=Default printf
#DSOCentralR20-WB5MMG.menu.printf.default.compiler.c.elf.extra_flags=
DSOCentralR20-WB5MMG.menu.printf.full=Full printf
DSOCentralR20-WB5MMG.menu.printf.full.compiler.c.elf.extra_flags=-Wl,-u,vfprintf -u_printf_float
DSOCentralR20-WB5MMG.menu.printf.minimal=Minimal printf
DSOCentralR20-WB5MMG.menu.printf.minimal.compiler.c.elf.extra_flags=-Wl,-u,vfprintf -u_printf_min
DSOCentralR20-WB5MMG.menu.printf.default=No printf
DSOCentralR20-WB5MMG.menu.printf.default.compiler.c.elf.extra_flags=

DSOCentralR20-WB5MMG.menu.usb.cdc=Serial
DSOCentralR20-WB5MMG.menu.usb.cdc.build.usb_type=1
DSOCentralR20-WB5MMG.menu.usb.cdc_msc=Serial + Mass Storage
DSOCentralR20-WB5MMG.menu.usb.cdc_msc.build.usb_type=2
DSOCentralR20-WB5MMG.menu.usb.none=No USB
DSOCentralR20-WB5MMG.menu.usb.none.build.usb_type=0

DSOCentralR20-WB5MMG.menu.speed.64=64 MHz
DSOCentralR20-WB5MMG.menu.speed.64.build.f_cpu=64000000L
DSOCentralR20-WB5MMG.menu.speed.32=32 MHz
DSOCentralR20-WB5MMG.menu.speed.32.build.f_cpu=32000000L
DSOCentralR20-WB5MMG.menu.speed.16=16 MHz (No USB)
DSOCentralR20-WB5MMG.menu.speed.16.build.f_cpu=16000000L
DSOCentralR20-WB5MMG.menu.speed.2=2 MHz (No USB)
DSOCentralR20-WB5MMG.menu.speed.2.build.f_cpu=2000000L

DSOCentralR20-WB5MMG.menu.security.none=None
DSOCentralR20-WB5MMG.menu.security.sien=Signature + Encryption
DSOCentralR20-WB5MMG.menu.security.sien.build.security_flags=-e "{build.keys.keychain}/{build.keys.encrypt_key}" -s "{build.keys.keychain}/{build.keys.sign_key}"
DSOCentralR20-WB5MMG.menu.security.sien.build.keys.keychain={runtime.platform.path}/libraries/STM32WB/keys
DSOCentralR20-WB5MMG.menu.security.sien.build.keys.sign_key=rsa2048_key.pem
DSOCentralR20-WB5MMG.menu.security.sien.build.keys.encrypt_key=aes128_key.bin

# ST Nucleo
# ---------------------------------------
NUCLEO-WB55RG.name=NUCLEO-WB55RG
NUCLEO-WB55RG.vid.0=0x0483
NUCLEO-WB55RG.pid.0=0x374b

NUCLEO-WB55RG.build.f_cpu=64000000L
NUCLEO-WB55RG.build.board=STM32WB_NUCLEO
NUCLEO-WB55RG.build.arch=stm32wb
NUCLEO-WB55RG.build.core=arduino
NUCLEO-WB55RG.build.mcu=cortex-m4
NUCLEO-WB55RG.build.architecture=armv7e-m
NUCLEO-WB55RG.build.fpu=fpv4-sp-d16
NUCLEO-WB55RG.build.float-abi=hard
NUCLEO-WB55RG.build.extra_flags=-DSTM32WB55xx -fsingle-precision-constant "-D__SYSTEM_CORE_CLOCK__={build.f_cpu}" {build.storage_flags} 
NUCLEO-WB55RG.build.ldscript=STM32WB55xx_FLASH.ld 
NUCLEO-WB55RG.build.openocdscript=openocd_scripts/nucleo-wb55rg.cfg
NUCLEO-WB55RG.build.variant=NUCLEO-WB55RG
NUCLEO-WB55RG.build.variant_system_libs="-L{runtime.platform.path}/system/STM32WBxx/Lib" "-L{runtime.platform.path}/system/CMSIS/DSP/Lib" -lstm32wb55xx -larm_cortexM4lf_math
NUCLEO-WB55RG.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Core/Include" "-I{runtime.platform.path}/system/CMSIS/DSP/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32WBxx/Include" "-I{runtime.platform.path}/system/STM32WBxx/Include" 

NUCLEO-WB55RG.upload.tool=openocd
NUCLEO-WB55RG.upload.tool.default=openocd
NUCLEO-WB55RG.upload.protocol=stlink
NUCLEO-WB55RG.upload.use_1200bps_touch=false
NUCLEO-WB55RG.upload.wait_for_upload_port=false
NUCLEO-WB55RG.upload.native_usb=false
NUCLEO-WB55RG.upload.maximum_size=786432
NUCLEO-WB55RG.upload.maximum_data_size=196608

NUCLEO-WB55RG.menu.storage.none=None
NUCLEO-WB55RG.menu.storage.none.build.storage_type=0
NUCLEO-WB55RG.menu.storage.sflash=SFLASH
NUCLEO-WB55RG.menu.storage.sflash.build.storage_type=1
NUCLEO-WB55RG.menu.storage.sdspi=SDCARD
NUCLEO-WB55RG.menu.storage.sdspi.build.storage_type=2

NUCLEO-WB55RG.menu.speed.64=64 MHz
NUCLEO-WB55RG.menu.speed.64.build.f_cpu=64000000L
NUCLEO-WB55RG.menu.speed.32=32 MHz
NUCLEO-WB55RG.menu.speed.32.build.f_cpu=32000000L
NUCLEO-WB55RG.menu.speed.16=16 MHz (No USB)
NUCLEO-WB55RG.menu.speed.16.build.f_cpu=16000000L
NUCLEO-WB55RG.menu.speed.2=2 MHz (No USB)
NUCLEO-WB55RG.menu.speed.2.build.f_cpu=2000000L
